Table of Contents
 Class StandardCheckSection
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Single check section
[OpenModelClass("CI.Concrete.SingleCheckProject.StandardSection,CI.SingleCheckProject", "CI.Services.Concrete.ServicePoint.ISingleCheckSection,CI.ServiceTypes", typeof(CheckSection))]
public class StandardCheckSection : CheckSection
Inheritance
object
OpenObject
OpenElementId
CheckSection
StandardCheckSection
Inherited Members
 CheckSection.Description
 CheckSection.CheckMember
 CheckSection.ReinfSection
 CheckSection.Extremes
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 StandardCheckSection()
Constructor
public StandardCheckSection()
 Edit this page